In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
dates = pd.date_range('20130101', periods = 6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.rand(6,4), index = dates, columns= list('ABCD'))
df

                   A         B         C         D
2013-01-01  0.047633  0.207111  0.126660  0.688393
2013-01-02  0.555663  0.790033  0.506914  0.134718
2013-01-03  0.586507  0.095938  0.879760  0.931573
2013-01-04  0.584959  0.275858  0.516909  0.590565
2013-01-05  0.513940  0.587068  0.689490  0.767815
2013-01-06  0.915374  0.512106  0.443339  0.348506

In [5]:
df2 = pd.DataFrame({'A': 1.,
                    'B': pd.Timestamp('20130102'),
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D': np.array([3] * 4, dtype='int32'),
                    'E': pd.Categorical(["test", "train", "test", "train"]),
                    'F': 'foo'})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [6]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [7]:
df.head()

                   A         B         C         D
2013-01-01  0.047633  0.207111  0.126660  0.688393
2013-01-02  0.555663  0.790033  0.506914  0.134718
2013-01-03  0.586507  0.095938  0.879760  0.931573
2013-01-04  0.584959  0.275858  0.516909  0.590565
2013-01-05  0.513940  0.587068  0.689490  0.767815

In [8]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.584959  0.275858  0.516909  0.590565
2013-01-05  0.513940  0.587068  0.689490  0.767815
2013-01-06  0.915374  0.512106  0.443339  0.348506

In [9]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [11]:
df.to_numpy()

array([[0.04763307, 0.20711097, 0.12665979, 0.68839344],
       [0.55566312, 0.79003347, 0.50691368, 0.13471783],
       [0.58650715, 0.09593811, 0.87976016, 0.93157307],
       [0.58495914, 0.27585836, 0.51690926, 0.59056498],
       [0.51394041, 0.58706822, 0.68949008, 0.76781469],
       [0.91537398, 0.51210624, 0.44333878, 0.34850613]])

In [12]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [13]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.534013  0.411353  0.527179  0.576928
std    0.278648  0.262292  0.252436  0.290705
min    0.047633  0.095938  0.126660  0.134718
25%    0.524371  0.224298  0.459233  0.409021
50%    0.570311  0.393982  0.511911  0.639479
75%    0.586120  0.568328  0.646345  0.747959
max    0.915374  0.790033  0.879760  0.931573

In [14]:
df

                   A         B         C         D
2013-01-01  0.047633  0.207111  0.126660  0.688393
2013-01-02  0.555663  0.790033  0.506914  0.134718
2013-01-03  0.586507  0.095938  0.879760  0.931573
2013-01-04  0.584959  0.275858  0.516909  0.590565
2013-01-05  0.513940  0.587068  0.689490  0.767815
2013-01-06  0.915374  0.512106  0.443339  0.348506

In [15]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.047633    0.555663    0.586507    0.584959    0.513940    0.915374
B    0.207111    0.790033    0.095938    0.275858    0.587068    0.512106
C    0.126660    0.506914    0.879760    0.516909    0.689490    0.443339
D    0.688393    0.134718    0.931573    0.590565    0.767815    0.348506

In [16]:
df.sort_index(axis = 1, ascending= False)

                   D         C         B         A
2013-01-01  0.688393  0.126660  0.207111  0.047633
2013-01-02  0.134718  0.506914  0.790033  0.555663
2013-01-03  0.931573  0.879760  0.095938  0.586507
2013-01-04  0.590565  0.516909  0.275858  0.584959
2013-01-05  0.767815  0.689490  0.587068  0.513940
2013-01-06  0.348506  0.443339  0.512106  0.915374

In [17]:
df.sort_values(by = 'B', ascending=False)

                   A         B         C         D
2013-01-02  0.555663  0.790033  0.506914  0.134718
2013-01-05  0.513940  0.587068  0.689490  0.767815
2013-01-06  0.915374  0.512106  0.443339  0.348506
2013-01-04  0.584959  0.275858  0.516909  0.590565
2013-01-01  0.047633  0.207111  0.126660  0.688393
2013-01-03  0.586507  0.095938  0.879760  0.931573

In [18]:
df['A']

2013-01-01    0.047633
2013-01-02    0.555663
2013-01-03    0.586507
2013-01-04    0.584959
2013-01-05    0.513940
2013-01-06    0.915374
Freq: D, Name: A, dtype: float64

In [19]:
df[0:3]

                   A         B         C         D
2013-01-01  0.047633  0.207111  0.126660  0.688393
2013-01-02  0.555663  0.790033  0.506914  0.134718
2013-01-03  0.586507  0.095938  0.879760  0.931573

In [20]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.555663  0.790033  0.506914  0.134718
2013-01-03  0.586507  0.095938  0.879760  0.931573
2013-01-04  0.584959  0.275858  0.516909  0.590565

In [21]:
df.loc[dates[0]]

A    0.047633
B    0.207111
C    0.126660
D    0.688393
Name: 2013-01-01 00:00:00, dtype: float64

In [22]:
df.loc[:, ['A','C','B']]

                   A         C         B
2013-01-01  0.047633  0.126660  0.207111
2013-01-02  0.555663  0.506914  0.790033
2013-01-03  0.586507  0.879760  0.095938
2013-01-04  0.584959  0.516909  0.275858
2013-01-05  0.513940  0.689490  0.587068
2013-01-06  0.915374  0.443339  0.512106

In [23]:
df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-02  0.555663  0.790033
2013-01-03  0.586507  0.095938
2013-01-04  0.584959  0.275858

In [24]:
df.loc['20130102', ['A', 'B']]

A    0.555663
B    0.790033
Name: 2013-01-02 00:00:00, dtype: float64

In [25]:
df.loc[dates[0], 'A']

0.04763307020336638

In [26]:
df.at[dates[0], 'A']

0.04763307020336638

In [27]:
df.iloc[3]

A    0.584959
B    0.275858
C    0.516909
D    0.590565
Name: 2013-01-04 00:00:00, dtype: float64

In [28]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  0.584959  0.275858
2013-01-05  0.513940  0.587068

In [29]:
df.iloc[[1,2,4], [0,2]]

                   A         C
2013-01-02  0.555663  0.506914
2013-01-03  0.586507  0.879760
2013-01-05  0.513940  0.689490

In [30]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  0.207111  0.126660
2013-01-02  0.790033  0.506914
2013-01-03  0.095938  0.879760
2013-01-04  0.275858  0.516909
2013-01-05  0.587068  0.689490
2013-01-06  0.512106  0.443339

In [31]:
df.iloc[1,1]

0.7900334740786655

In [32]:
df.iat[1,1]

0.7900334740786655

In [33]:
df[df['A'] > 0]

                   A         B         C         D
2013-01-01  0.047633  0.207111  0.126660  0.688393
2013-01-02  0.555663  0.790033  0.506914  0.134718
2013-01-03  0.586507  0.095938  0.879760  0.931573
2013-01-04  0.584959  0.275858  0.516909  0.590565
2013-01-05  0.513940  0.587068  0.689490  0.767815
2013-01-06  0.915374  0.512106  0.443339  0.348506

In [34]:
df[df < 0]

             A   B   C   D
2013-01-01 NaN NaN NaN NaN
2013-01-02 NaN NaN NaN NaN
2013-01-03 NaN NaN NaN NaN
2013-01-04 NaN NaN NaN NaN
2013-01-05 NaN NaN NaN NaN
2013-01-06 NaN NaN NaN NaN

In [35]:
df2 = df.copy()
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2013-01-01  0.047633  0.207111  0.126660  0.688393    one
2013-01-02  0.555663  0.790033  0.506914  0.134718    one
2013-01-03  0.586507  0.095938  0.879760  0.931573    two
2013-01-04  0.584959  0.275858  0.516909  0.590565  three
2013-01-05  0.513940  0.587068  0.689490  0.767815   four
2013-01-06  0.915374  0.512106  0.443339  0.348506  three

In [36]:
df2[df2['E'].isin(['two','four'])]

                   A         B        C         D     E
2013-01-03  0.586507  0.095938  0.87976  0.931573   two
2013-01-05  0.513940  0.587068  0.68949  0.767815  four

In [37]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [38]:
df['F'] = s1

In [39]:
df

                   A         B         C         D    F
2013-01-01  0.047633  0.207111  0.126660  0.688393  NaN
2013-01-02  0.555663  0.790033  0.506914  0.134718  1.0
2013-01-03  0.586507  0.095938  0.879760  0.931573  2.0
2013-01-04  0.584959  0.275858  0.516909  0.590565  3.0
2013-01-05  0.513940  0.587068  0.689490  0.767815  4.0
2013-01-06  0.915374  0.512106  0.443339  0.348506  5.0

In [40]:
df.at[dates[0], 'A'] = 0

In [41]:
df

                   A         B         C         D    F
2013-01-01  0.000000  0.207111  0.126660  0.688393  NaN
2013-01-02  0.555663  0.790033  0.506914  0.134718  1.0
2013-01-03  0.586507  0.095938  0.879760  0.931573  2.0
2013-01-04  0.584959  0.275858  0.516909  0.590565  3.0
2013-01-05  0.513940  0.587068  0.689490  0.767815  4.0
2013-01-06  0.915374  0.512106  0.443339  0.348506  5.0

In [42]:
df.iat[0, 1] = 0

In [43]:
df.loc[:, 'D'] = np.array([5] * len(df))

In [44]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.126660  5  NaN
2013-01-02  0.555663  0.790033  0.506914  5  1.0
2013-01-03  0.586507  0.095938  0.879760  5  2.0
2013-01-04  0.584959  0.275858  0.516909  5  3.0
2013-01-05  0.513940  0.587068  0.689490  5  4.0
2013-01-06  0.915374  0.512106  0.443339  5  5.0

In [45]:
df2 = df.copy()

In [46]:
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.126660  5  NaN
2013-01-02  0.555663  0.790033  0.506914  5  1.0
2013-01-03  0.586507  0.095938  0.879760  5  2.0
2013-01-04  0.584959  0.275858  0.516909  5  3.0
2013-01-05  0.513940  0.587068  0.689490  5  4.0
2013-01-06  0.915374  0.512106  0.443339  5  5.0

In [47]:
df2[df2 > 0] = -df2

In [48]:
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.126660 -5  NaN
2013-01-02 -0.555663 -0.790033 -0.506914 -5 -1.0
2013-01-03 -0.586507 -0.095938 -0.879760 -5 -2.0
2013-01-04 -0.584959 -0.275858 -0.516909 -5 -3.0
2013-01-05 -0.513940 -0.587068 -0.689490 -5 -4.0
2013-01-06 -0.915374 -0.512106 -0.443339 -5 -5.0

In [49]:
s1 = pd.Series([1,2,3,4,5,6], index = pd.date_range('20130102', periods = 6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [51]:
df['F'] = s1
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.126660  5  NaN
2013-01-02  0.555663  0.790033  0.506914  5  1.0
2013-01-03  0.586507  0.095938  0.879760  5  2.0
2013-01-04  0.584959  0.275858  0.516909  5  3.0
2013-01-05  0.513940  0.587068  0.689490  5  4.0
2013-01-06  0.915374  0.512106  0.443339  5  5.0

In [52]:
df.at[dates[0], 'A'] = 0

In [53]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.126660  5  NaN
2013-01-02  0.555663  0.790033  0.506914  5  1.0
2013-01-03  0.586507  0.095938  0.879760  5  2.0
2013-01-04  0.584959  0.275858  0.516909  5  3.0
2013-01-05  0.513940  0.587068  0.689490  5  4.0
2013-01-06  0.915374  0.512106  0.443339  5  5.0

In [54]:
df.iat[0, 1] = 0

In [55]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.126660  5  NaN
2013-01-02  0.555663  0.790033  0.506914  5  1.0
2013-01-03  0.586507  0.095938  0.879760  5  2.0
2013-01-04  0.584959  0.275858  0.516909  5  3.0
2013-01-05  0.513940  0.587068  0.689490  5  4.0
2013-01-06  0.915374  0.512106  0.443339  5  5.0

In [56]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.126660 -5  NaN
2013-01-02 -0.555663 -0.790033 -0.506914 -5 -1.0
2013-01-03 -0.586507 -0.095938 -0.879760 -5 -2.0
2013-01-04 -0.584959 -0.275858 -0.516909 -5 -3.0
2013-01-05 -0.513940 -0.587068 -0.689490 -5 -4.0
2013-01-06 -0.915374 -0.512106 -0.443339 -5 -5.0

In [59]:
df1 = df.reindex(index = dates[0:4], columns = list(df.columns) + ['E'])
df1.loc[dates[0]:dates[1], 'E'] = 1
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.126660  5  NaN  1.0
2013-01-02  0.555663  0.790033  0.506914  5  1.0  1.0
2013-01-03  0.586507  0.095938  0.879760  5  2.0  NaN
2013-01-04  0.584959  0.275858  0.516909  5  3.0  NaN

In [60]:
df1.dropna(how = 'any')
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.126660  5  NaN  1.0
2013-01-02  0.555663  0.790033  0.506914  5  1.0  1.0
2013-01-03  0.586507  0.095938  0.879760  5  2.0  NaN
2013-01-04  0.584959  0.275858  0.516909  5  3.0  NaN

In [63]:
df1.fillna(value = 5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.126660  5  5.0  1.0
2013-01-02  0.555663  0.790033  0.506914  5  1.0  1.0
2013-01-03  0.586507  0.095938  0.879760  5  2.0  5.0
2013-01-04  0.584959  0.275858  0.516909  5  3.0  5.0

In [64]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [65]:
df.mean()

A    0.526074
B    0.376834
C    0.527179
D    5.000000
F    3.000000
dtype: float64

In [66]:
df.mean(1)

2013-01-01    1.281665
2013-01-02    1.570522
2013-01-03    1.712441
2013-01-04    1.875545
2013-01-05    2.158100
2013-01-06    2.374164
Freq: D, dtype: float64

In [68]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [69]:
df.sub(s, axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -0.413493 -0.904062 -0.120240  4.0  1.0
2013-01-04 -2.415041 -2.724142 -2.483091  2.0  0.0
2013-01-05 -4.486060 -4.412932 -4.310510  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

In [70]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000  0.126660   5   NaN
2013-01-02  0.555663  0.790033  0.633573  10   1.0
2013-01-03  1.142170  0.885972  1.513334  15   3.0
2013-01-04  1.727129  1.161830  2.030243  20   6.0
2013-01-05  2.241070  1.748898  2.719733  25  10.0
2013-01-06  3.156444  2.261004  3.163072  30  15.0

In [71]:
df.apply(lambda x: x.max() - x.min())

A    0.915374
B    0.790033
C    0.753100
D    0.000000
F    4.000000
dtype: float64

In [73]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    5
1    3
2    4
3    3
4    1
5    2
6    5
7    4
8    6
9    3
dtype: int64

In [74]:
s.value_counts()

3    3
5    2
4    2
6    1
2    1
1    1
dtype: int64

In [75]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [76]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [77]:
df = pd.DataFrame(np.random.randn(10,4))
df

          0         1         2         3
0 -0.771799 -0.558672 -0.500493 -0.549051
1 -0.170597  0.137966  0.644394  0.091797
2  0.423758 -0.683070 -0.020915  0.263937
3 -0.607895 -2.684088  0.107042  0.084751
4  1.119268  0.481303 -1.734499  0.292839
5 -0.445806  0.483053 -0.251523 -0.420229
6  0.821091  1.000074  0.610375 -0.220128
7  0.538395  0.495220 -1.790468  0.825347
8 -0.471141 -0.633428  0.329666 -1.296166
9 -1.398527 -0.419353  2.256041  0.150879

In [78]:
pieces = [df[:3], df[3:7], df[7:]]
pd.concat(pieces)

          0         1         2         3
0 -0.771799 -0.558672 -0.500493 -0.549051
1 -0.170597  0.137966  0.644394  0.091797
2  0.423758 -0.683070 -0.020915  0.263937
3 -0.607895 -2.684088  0.107042  0.084751
4  1.119268  0.481303 -1.734499  0.292839
5 -0.445806  0.483053 -0.251523 -0.420229
6  0.821091  1.000074  0.610375 -0.220128
7  0.538395  0.495220 -1.790468  0.825347
8 -0.471141 -0.633428  0.329666 -1.296166
9 -1.398527 -0.419353  2.256041  0.150879

In [79]:
 df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar',
                          'foo', 'bar', 'foo', 'foo'],
                    'B': ['one', 'one', 'two', 'three',
                         'two', 'two', 'one', 'three'],
                    'C': np.random.randn(8),
                    'D': np.random.randn(8)})

In [80]:
df

     A      B         C         D
0  foo    one  0.771141  0.980464
1  bar    one -2.154609 -2.536653
2  foo    two -0.972698  0.536224
3  bar  three  1.982450  0.852471
4  foo    two  0.726740  0.253909
5  bar    two -2.144004 -1.080013
6  foo    one -0.147801 -0.805038
7  foo  three  0.882153  0.617365

In [84]:
df.groupby('A').sum()

            C         D
A
bar -2.316163 -2.764195
foo  1.259535  1.582924

In [85]:
df.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one   -2.154609 -2.536653
    three  1.982450  0.852471
    two   -2.144004 -1.080013
foo one    0.623341  0.175426
    three  0.882153  0.617365
    two   -0.245958  0.790133

In [86]:
df = pd.DataFrame({'A': ['one', 'one', 'two', 'three'] * 3,
                   'B': ['A', 'B', 'C'] * 4,
                   'C': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                    'D': np.random.randn(12),
                    'E': np.random.randn(12)})
df

        A  B    C         D         E
0     one  A  foo -0.105959 -0.188346
1     one  B  foo  0.718372  0.097325
2     two  C  foo -0.492369  1.583553
3   three  A  bar  1.864818 -0.909704
4     one  B  bar -2.418381  0.714640
5     one  C  bar  0.424411  0.589293
6     two  A  foo  0.512893  0.585144
7   three  B  foo  0.439186  0.946762
8     one  C  foo  1.052621 -0.459706
9     one  A  bar -0.021849  1.892971
10    two  B  bar -1.841748 -0.275074
11  three  C  bar  0.380382 -1.009834

In [87]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A -0.021849 -0.105959
      B -2.418381  0.718372
      C  0.424411  1.052621
three A  1.864818       NaN
      B       NaN  0.439186
      C  0.380382       NaN
two   A       NaN  0.512893
      B -1.841748       NaN
      C       NaN -0.492369